import re
filepath = "/Users/uldanakonyratbaeva/Desktop/row.txt"
with open(filepath, "r", encoding="utf-8") as file:
    text = file.read()

items = re.findall(r"\d+\.\n(.*?)\n\d+,\d{3} x \d{1,3} ?\d{0,3},\d{2}", text, re.DOTALL)
prices = re.findall(r"(\d+,\d{3}) x (\d{1,3} ?\d{0,3},\d{2})\n(\d{1,3} ?\d{0,3},\d{2})", text)
total = re.search(r"ИТОГО:\n([\d\s]+,\d{2})", text)
receipt_number = re.search(r"Чек №(\d+)", text)
date_time = re.search(r"Время: ([\d.]+ [\d:]+)", text)


print("Найденные товары:")
for i, item in enumerate(items):
    qty, price, total_price = prices[i][:3]
    print(f"{i+1}. {item.strip()} - {qty} шт. * {price} = {total_price}")

if total: 
    print(f"\nОбщая сумма покупки: {total.group(1)}")

if receipt_number and date_time:
    print(f"\n Номер чека: {receipt_number.group(1)}")
    print(f"Дата и время: {date_time.group(1)}")

"""
Найденные товары:
1. Натрия хлорид 0,9%, 200 мл, фл - 2,000 шт. * 154,00 = 308,00
2. Борный спирт 3%, 20 мл, фл. - 1,000 шт. * 51,00 = 51,00
3. Шприц 2 мл, 3-х комп. (Bioject) - 2,000 шт. * 16,00 = 32,00
4. Система для инфузии Vogt Medical - 2,000 шт. * 60,00 = 120,00
5. Naturella прокладки Классик макси №8 - 1,000 шт. * 310,00 = 310,00
6. AURA Ватные диски №150 - 1,000 шт. * 461,00 = 461,00
7. Чистая линия скраб мягкий 50 мл - 1,000 шт. * 381,00 = 381,00
8. Чистая линия  скраб очищающийабрикос 50 мл - 1,000 шт. * 386,00 = 386,00
9. Чистая линия скраб мягкий 50 мл - 1,000 шт. * 381,00 = 381,00
10. Carefree салфетки Алоэвоздухопроницаемые №20 - 1,000 шт. * 414,00 = 414,00
11. Pro Series Шампунь яркий цвет 500мл - 1,000 шт. * 841,00 = 841,00
12. Pro Series бальзам-ополаскивательдля длител ухода за окрашеннымиволосами Яркий цвет 500мл - 1,000 шт. * 841,00 = 841,00
13. Clear шампунь Актив спорт 2в1мужской  400 мл - 1,000 шт. * 1 200,00 = 1 200,00
14. Bio World (HYDRO THERAPY)Мицеллярная вода 5в1, 445мл - 1,000 шт. * 1 152,00 = 1 152,00
15. Bio World (HYDRO THERAPY) Гель-муссдля умывания с гиалуроновойкислотой, 250мл - 1,000 шт. * 1 152,00 = 1 152,00
16. [RX]-Натрия хлорид 0,9%, 100 мл, фл. - 1,000 шт. * 168,00 = 168,00
17. [RX]-Дисоль р-р 400 мл, фл. - 1,000 шт. * 163,00 = 163,00
18. Тагансорбент с иономи серебра №30,пор. - 1,000 шт. * 1 526,00 = 1 526,00
19. [RX]-Церукал 2%, 2 мл, №10, амп. - 2,000 шт. * 396,00 = 792,00
20. [RX]-Андазол 200 мг, №40, табл. - 1,000 шт. * 7 330,00 = 7 330,00

Общая сумма покупки: 18 009,00

 Номер чека: 2331180266
Дата и время: 18.04.2019 11:13:58
"""
